balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F6525.PIC
      <edc:DCRDef edc:access="n-----nn" edc:cname="CONFIG3L" edc:default="0x83" edc:desc="" edc:impl="0x83" edc:name="CONFIG3L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x0">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x3" edc:name="RESERVED" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="" edc:desc="Maintain bits as 1s." edc:memmodeidref="microctrl" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="RES" edc:desc="RESERVED" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="RES" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="" edc:desc="Maintain bit as 1." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n-----nn" edc:cname="CONFIG3H" edc:default="0x83" edc:desc="" edc:impl="0x83" edc:name="CONFIG3H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x81">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CCP2MX" edc:desc="ECCP2 Mux bit" edc:mask="0x1" edc:name="CCP2MX" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="PORTC" edc:desc="Multiplexed with RC1" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PORTBE" edc:desc="Multiplexed with RB3 or RE7" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES" edc:desc="RESERVED" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="RES" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="" edc:desc="Maintain bit as 1." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="MCLR Enable bit" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="MCLR pin enabled, RG5 input pin disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RG5 input enabled, MCLR disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n----n-n" edc:cname="CONFIG4L" edc:default="0x85" edc:desc="" edc:impl="0x85" edc:name="CONFIG4L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x85">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="STVR" edc:desc="Stack Full/Underflow Reset Enable bit" edc:mask="0x1" edc:name="STVR" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Stack full/underflow will cause Reset" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Stack full/underflow will not cause Reset" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="LVP" edc:desc="Low-Voltage ICSP Enable bit" edc:mask="0x1" edc:name="LVP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Low-Voltage ICSP enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Low-Voltage ICSP disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable bit" edc:isidehidden="true" edc:mask="0x1" edc:name="DEBUG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Background debugger disabled. RB6 and RB7 configured as general purpose I/O pins." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Background debugger enabled. RB6 and RB7 are dedicated to in-circuit debug." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:offset="1"/>
      <edc:DCRDef edc:access="----nnnn" edc:cname="CONFIG5L" edc:default="0xf" edc:desc="" edc:impl="0xf" edc:name="CONFIG5L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CP0" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 0 (000800-003FFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 0 (000800-003FFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x800" edc:checksumalgo="0x27" edc:endaddr="0x4000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP1" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 1 (004000-007FFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 1 (004000-007FFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x4000" edc:checksumalgo="0x27" edc:endaddr="0x8000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP2" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP2" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 2 (008000-00BFFFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 2 (008000-00BFFFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x8000" edc:checksumalgo="0x27" edc:endaddr="0xc000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES" edc:desc="RESERVED" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="RES" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="" edc:desc="Maintain bit as 1." edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nn------" edc:cname="CONFIG5H" edc:default="0xc0" edc:desc="" edc:impl="0xc0" edc:name="CONFIG5H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc0">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:DCRFieldDef edc:cname="CPB" edc:desc="Boot Block Code Protection bit" edc:mask="0x1" edc:name="CPB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot block (000000-0007FFh) not code-protected" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot block (000000-0007FFh) code-protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x800"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CPD" edc:desc="Data EEPROM Code Protection bit" edc:mask="0x1" edc:name="CPD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data EEPROM not code-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data EEPROM code-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="----nnnn" edc:cname="CONFIG6L" edc:default="0xf" edc:desc="" edc:impl="0xf" edc:name="CONFIG6L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WRT0" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 0 (000800-003FFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 0 (000800-003FFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT1" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT1" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 1 (004000-007FFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 1 (004000-007FFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRT2" edc:desc="Write Protection bit" edc:mask="0x1" edc:name="WRT2" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Block 2 (008000-00BFFFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Block 2 (008000-00BFFFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES" edc:desc="RESERVED" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="RES" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="" edc:desc="Maintain bit as 1." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnn-----" edc:cname="CONFIG6H" edc:default="0xe0" edc:desc="" edc:impl="0xe0" edc:name="CONFIG6H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xe0">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="WRTC" edc:desc="Configuration Register Write Protection bit" edc:mask="0x1" edc:name="WRTC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Configuration registers (300000-3000FFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Configuration registers (300000-3000FFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTB" edc:desc="Boot Block Write Protection bit" edc:mask="0x1" edc:name="WRTB" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Boot block (000000-0007FFh) not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Boot block (000000-0007FFh) write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WRTD" edc:desc="Data EEPROM Write Protection bit" edc:mask="0x1" edc:name="WRTD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data EEPROM not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data EEPROM write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
